{"meta":{"title":"DragonJayのblog","subtitle":"一只高二狗","description":"","author":"DragonJay","url":"https://blog.furrysp.top","root":"/"},"pages":[{"title":"","date":"2022-01-19T14:00:38.072Z","updated":"2021-12-18T09:15:39.453Z","comments":true,"path":"404.html","permalink":"https://blog.furrysp.top/404.html","excerpt":"","text":"404 很抱歉，您访问的页面不存在 可能是输入地址有误或该地址已被删除"},{"title":"","date":"2022-01-20T12:14:02.075Z","updated":"2022-01-20T12:14:02.075Z","comments":true,"path":"about/index.html","permalink":"https://blog.furrysp.top/about/index.html","excerpt":"","text":"关于 您正在与&nbsp;kelecn&nbsp;对话中... bot_ui_ini() 联系方式QQ：410714630 邮箱：yul62788@gmail.com 查看放大的地图 | 获取路线"},{"title":"","date":"2022-01-19T14:00:38.072Z","updated":"2021-12-18T09:16:33.048Z","comments":false,"path":"artitalk/index.html","permalink":"https://blog.furrysp.top/artitalk/index.html","excerpt":"","text":""},{"title":"bb","date":"2022-01-20T03:41:32.000Z","updated":"2022-01-20T03:42:20.460Z","comments":true,"path":"bb/index.html","permalink":"https://blog.furrysp.top/bb/index.html","excerpt":"","text":""},{"title":"我的朋友们","date":"2022-01-23T13:30:15.964Z","updated":"2022-01-23T13:30:15.964Z","comments":true,"path":"friends/index.html","permalink":"https://blog.furrysp.top/friends/index.html","excerpt":"🚧 友链正逐步恢复 🌹关于申请友链条件🎄先友后链，申请前请先提前做好本站友情链接💖稳定更新，每月至少发布1篇文章🍧凡内容污秽、暴力的、广告挂马的、违背社会主义核心价值观的勿扰🎯申请方式请在底部或者留言板留言 👋关于申请格式 本站基本信息如下，申请时请也按照相同格式：名称：DragonJay’s blog链接：https://blog.furrysp.top描述：あなたは主人公になりたいですか?头像:https://sdn.geekzu.org/avatar/26fb4e9d679e499d8545df9f2aea519c?s=100 ❌无法访问或单方面取消不定时排查，无法访问或单方面取消，将会移除链接，恕不告知🧐","text":"🚧 友链正逐步恢复 🌹关于申请友链条件🎄先友后链，申请前请先提前做好本站友情链接💖稳定更新，每月至少发布1篇文章🍧凡内容污秽、暴力的、广告挂马的、违背社会主义核心价值观的勿扰🎯申请方式请在底部或者留言板留言 👋关于申请格式 本站基本信息如下，申请时请也按照相同格式：名称：DragonJay’s blog链接：https://blog.furrysp.top描述：あなたは主人公になりたいですか?头像:https://sdn.geekzu.org/avatar/26fb4e9d679e499d8545df9f2aea519c?s=100 ❌无法访问或单方面取消不定时排查，无法访问或单方面取消，将会移除链接，恕不告知🧐 // 全局变量声明区域 var fdata = { apiurl: 'https://hexo-friendcircle-api-swart.vercel.app/api', initnumber: 20, //【可选】页面初始化展示文章数量 stepnumber: 10,//【可选】每次加载增加的篇数 error_img: '/image/404.gif' //【可选】头像加载失败时默认显示的头像 } //存入本地存储 localStorage.setItem(\"fdatalist\",JSON.stringify(fdata))"},{"title":"","date":"2022-01-22T05:23:33.073Z","updated":"2022-01-22T05:23:33.073Z","comments":true,"path":"photos/index.html","permalink":"https://blog.furrysp.top/photos/index.html","excerpt":"","text":""},{"title":"","date":"2022-01-22T05:39:57.906Z","updated":"2022-01-22T05:39:57.906Z","comments":true,"path":"photos/photos.json","permalink":"https://blog.furrysp.top/photos/photos.json","excerpt":"","text":"[{\"name\":\"furry\",\"children\":[\"6400.4560 23231499_p0.png\"]}]"},{"title":"","date":"2022-01-22T05:44:42.449Z","updated":"2022-01-22T05:44:42.449Z","comments":true,"path":"photos/photosInfo.json","permalink":"https://blog.furrysp.top/photos/photosInfo.json","excerpt":"","text":"[{\"dirName\":\"furry\",\"fileName\":\"23231499_p0.png\",\"iconID\":\"6400.4560 23231499_p0.png\",\"extension\":{\"size\":64,\"offset\":[0,0]}}]"},{"title":"DragonJayの书单","date":"2022-01-20T12:43:16.000Z","updated":"2022-01-20T12:46:47.337Z","comments":true,"path":"books/index.html","permalink":"https://blog.furrysp.top/books/index.html","excerpt":"","text":"《水浒传》是一部以描写古代农民起义为题材的长篇小说。它形象地描绘了农民起义从发生、发展直至失败的全过程，深刻揭示了起义的社会根源，满腔热情地歌颂了起义英雄的反抗斗争和他们的社会理想，也具体揭示了起义失败的内在历史原因。 《水浒传》 作者：施耐庵 出版时间：2005-04-01 读书笔记： 暂无 推荐指数： 《三国演义》描写了从东汉末年到西晋初年之间近百年的历史风云，以描写战争为主，诉说了东汉末年的群雄割据混战和魏、蜀、吴三国之间的政治和军事斗争，最终司马炎一统三国，建立晋朝的故事。反映了三国时代各类社会斗争与矛盾的转化，并概括了这一时代的历史巨变，塑造了一群叱咤风云的三国英雄人物。 《三国演义》 作者：罗贯中 出版时间：1986-06-01 读书笔记： 暂无 推荐指数： 《西游记》是中国古代魔幻小说中的巅峰之作，讲述了唐僧师徒四人一路降妖伏魔、历经艰险到西天求取真经的故事。书中借助惊险的故事充分展现了作者丰富的知识、惊人的想象力和高超的写作技巧。 《西游记》 作者：吴承恩 出版时间：1994-04-01 读书笔记：暂无 推荐指数： 《红楼梦》是一部现实主义和浪漫主义高度结合的伟大著作，也是一个时代文学艺术的顶峰。全书通过对“贾、史、王、薛”四大家族从繁荣到衰败的描写，真实地展现了当时的社会生活及风俗人情，堪称封建末世的百科全书。 《 红楼梦 》 作者：曹雪芹 出版时间：1996-12-01 读书笔记： 暂无 推荐指数："},{"title":"","date":"2022-01-22T11:11:39.850Z","updated":"2022-01-19T18:42:05.091Z","comments":true,"path":"covid/covid.html","permalink":"https://blog.furrysp.top/covid/covid.html","excerpt":"","text":""}],"posts":[{"title":"免费CDN","slug":"free-cdn","date":"2022-01-22T03:16:54.922Z","updated":"2022-01-22T03:45:09.147Z","comments":true,"path":"2022/01/22/free-cdn/","link":"","permalink":"https://blog.furrysp.top/2022/01/22/free-cdn/","excerpt":"","text":"它每天都在发生:你访问一个网站，但加载时间太长。几秒钟后，你退出页面并在搜索引擎结果页面中寻找另一个选项。高跳出率和糟糕的搜索引擎优化不一定是你作为网站所有者的命运。通过使用内容交付网络(或CDN)将慢速扼杀在萌芽状态。 CDN将站点的静态内容保存在世界各地的服务器上，然后将文件从离它们最近的服务器呈现给网站访问者。因此，JavaScript、图像和视频在网站前端的加载速度要快得多。 在这篇文章中，我将介绍你应该在CDN中寻找的顶级功能，然后回顾WordPress最好的免费CDN服务。 WordPress的关键CDN特性一个免费的内容分发网络应该提供基本的功能来加速你的WordPress站点，而不需要你升级到付费的包。注意以下特征: 全球服务器网络:内容交付网络的主要好处是，它将你的静态网站文件保存在离最终用户更近的服务器上。如果它的服务器网络不是全球性的，那么它就没有实现这个目的。 缓存功能:大多数CDN服务将提供自动网站缓存。这意味着你的网站副本将临时存储在最终用户的浏览器中。这样，他们每次访问你的网站时，你的网站会加载得更快。如果你正在为此寻找一个专用的插件，看看我的WordPress缓存插件综述。 图像和视频优化:你的CDN服务应该包括图像和视频优化功能，以减少网站的加载时间，并更快地向最终用户交付嵌入的内容。 CSS、JavaScript和HTML代码的精简:一个CDN还应该最大限度地减少你的站点没有积极使用的无关代码。 付费CDN服务提供更多功能，包括加速移动页面速度和高级分析。但是购买付费的CDN服务可能是不可能的，尤其是如果你是一个试图保持低成本的新博主。 幸运的是，有许多免费的CDN服务可以帮助你加快WordPress网站的速度。 SmartVideo SmartVideo由Swarmify创建，是一项免费的CDN服务，允许你在网站上嵌入视频，而无需依赖YouTube的嵌入代码。这个CDN是独一无二的，因为它特别关注视频——所以如果你是一个内容创作者、教育家或vlogger，你会想把这个CDN放在你的列表的顶部。 有了这个CDN，你可以向用户提供无缓冲播放，将YouTube和Vimeo嵌入代码转换成SmartVideo视频，并为视频播放器添加你的颜色和品牌。它与各种WordPress页面构建器兼容，包括Divi、Elementor、Beaver Builder和WordPress的原生古腾堡块编辑器。 这个插件对视频内容的关注意味着你不会享受到很多额外的功能。缓存、图像优化、JS和CSS缩小都需要一个额外的插件来完成。 这项CDN服务非常适合: 主要发布视频内容(教程、课程、游记、vlogs等)的新的或已建立的网站所有者。视频内容会显著降低你的网站速度，但这个CDN的轻量级视频播放器将确保这不会发生。该播放器还方便地排除诸如广告和推荐等分散注意力的内容。 W3 Total Cache W3总缓存是一个缓存插件，也提供了CDN服务。该插件与你的媒体库和主题文件集成，允许它们从其全局服务器之一加载。 这个插件支持加速移动页面和安全套接字层加密站点。它提供了多种缓存方法，包括“本地磁盘、Redis、Memcached、APC、APCu、eAccelerator、XCache和WinCache”方法。它的支持团队也很活跃，所以如果你有任何新的功能要建议或问题要解决，你会在一到三天内得到回应。 这项CDN服务非常适合: 希望获得全面定制的一体化解决方案的新网站所有者或老网站所有者。虽然它的CDN不是它的主要关注点，但它可以通过提供代码缩减选项和大量缓存来帮助你以多种方式加速你的网站。 LiteSpeed Cache LiteSpeed Cache是另一个为你的网站提供的免费CDN服务。它提供了图像优化功能，自动缓存你的页面，并缩小CSS、JS和HTML代码，提高你网站的加载速度。 此外，你可以延迟加载图像和iframes，并且可以使用其服务器网络异步加载CSS和JavaScript，以便只有最重要的代码呈现在最终用户端。 这项CDN服务非常适合: 运营WordPress多站点或在线商店的老牌网站所有者。这个插件与一个流行的电子商务插件WooCommerce兼容。一些缓存插件会干扰其他插件的功能，这就是为什么安装这个WordPress插件时要小心的原因。 CommonWPCommonWP是一个WordPress插件，它使用免费的公共CDN(通过[jsdeliver](https://www . jsdeliver . com/)来处理开源CSS和Javascript文件。这个插件通过获取Wordpress网站使用的大部分开源文件并从一个中心位置分发它们来提高速度(而不是在浏览器缓存中已经有相同文件的情况下重复下载)。 有了这个插件，用户无需配置任何设置，尽管开发人员可以根据自己的需要进行一些调整。只需安装插件，一旦激活，它就会在后台填满缓存。 由于它使用JsDelivr，CommonWP用户还受益于没有带宽限制、增加的安全性、全球数百个存在点以及拥有有效ICP许可证的网络——这意味着网站将在中国工作(现在不彳亍了)。 这项CDN服务非常适合: 预算有限的新网站所有者，他们希望获得简单但安全的CDN服务。 没有人喜欢加载缓慢的网页，它可能会损失数百万的销售额。一些有见地的事实: Shopzilla通过将加载时间从6秒提高到1.2秒，增加了12%的收入。 [亚马逊](https://geek flare . com/recommend/Amazon/)估计，一秒钟的放缓可能会导致每年16亿美元的销售额损失 由于处理缓慢，21%的购物者退出购物车 谷歌在技术搜索引擎优化信号中考虑页面加载时间，因此不仅是收入，而且快速加载也有助于更好的搜索排名。 安全性对网站性能同样至关重要，你必须考虑尽一切努力保护你的网络资产免受黑客攻击。 没有必要的网络安全保护可以帮助攻击者迅速摧毁你的网站，损害你的声誉和在线业务。SUCURI的最新报告显示，56%的网站存在安全风险。 所以你看，这两者对任何在线商业网站都是必不可少的。 多种方法可以解决这个问题，最简单的方法之一是为实现CDN 性能 面向基于云的安全提供商的 保护. 好消息是大多数CDN公司 都 提供这两种服务！ 让我仔细检查一下，看看哪一个适合你。 ArvanCloudArvanCloudhttps://www.arvancloud.com/cn/products/cdn 在全球拥有众多持久性有PoPs，提供各种云服务，尤其是为30，000多个网站提供强大的CDN服务。ArvanCloud CDN配备了尖端和专有技术，确保最高级别的安全性以及快速的数据传输。 与其他免费计划中对任何附加功能收费的CDN提供商不同，ArvanCloud的免费CDN层提供了与其付费计划相同的功能。每个网站都可以从ArvanCloud CDN的快速、安全、全功能体验中受益，完全免费。 免费CDN计划包括每月200GB的下载和上传流量，外加每月100万次请求。 此外，ArvanCloud还提供各种付费计划。这些服务采用现收现付模式，是市场上最具成本效益的CDN解决方案之一，非常适合低预算和大规模项目。 NetlifyNetlifyhttps://www.netlify.com/ 让你托管你的静态网站，并通过CDN提供服务。Netlify并不是一家典型的CDN公司，但是如果你托管的是一个静态网站，那么值得考虑Netlify。 超过35，000名开发人员和托管超过90，000个网站的人热爱Netlify。 Netlify在免费计划中提供以下内容。 重定向规则 持续部署 Let’s Encrypt certificate, HTTP/2 自定义域 全球 CDN, 快速解析 DNS 回滚 预解码，缓存无效 DDoS保护 Git集成 自定义 HTTP头 历史 你经营的是创业网站还是低流量网站？在免费套餐下， Hostryhttps://hostry.com/products/cdn/ 为欧盟+美国提供10GB，为全球流量提供5GB。 Hostry在全球范围内获得了52枚POP，并提供了一个起源盾。 CDN 或 内容交付网络 是一种方法，通过这种方法，你可以以更快的速度和更高的效率将内容从你的网站发送给生活在地质特定区域的人们。 有时，即使有一个好的托管计划，如果你的观众住得离你的网站服务器很远，你的网站加载速度也会受到影响。 当你使用CDN时，你正在多个服务器上缓存和存储所有内容。 因此，下一次你的观众想要查看你的一些内容时，他们将被重定向到最近的服务器，并且还会注意到你的网站的加载时间有了显著的改善。 除此之外，使用 CDN可以导致 搜索引擎优化，也减少了你的网站崩溃的机会。 一个高质量的CDN会带来网站加载速度的巨大差异。 现在，如果你喜欢使用CDN的想法，但你不确定它是否会有回报，你总是可以选择使用免费服务。 最佳免费CDN选项 最佳免费CDN选项列表。所以不用多说，我开始吧: 注意: CDN还会存储你所有的静态内容，比如图像、样式表、javascript、flash等等。除非服务提供商提到，否则它不能处理动态内容。 WPMU DEV CDNWPMU DEV是一个领先的WordPress产品平台，为各种重要功能提供全面管理的托管和大量高质量插件。 如果你选择WPMU托管，CDN将会预先配置，通过分布在5大洲45个服务器位置的CDN，使你的站点加载速度超快。 你的网站将通过 高性能服务器 (SSD) 以提高网站的整体性能。它将帮助你提高谷歌核心的重要分数，排名，并提供更好的用户体验。 如果你的网站托管在其他地方，你可以利用 WPMU CDN 通过使用他们的图像优化插件Smush Pro或Hummingbird Pro，这是一个网站速度优化和缓存插件。 当你使用Smush Pro插件时，你站点中的图像将通过位于 45个不同的地点 让你的网站加载更快。 如果你使用Hummingbird专业插件作为你的首选缓存插件，你将获得对你的网站无限的CDN访问。这个插件可以让你的网站更快地加载所有它必须提供的功能和选项。 你可以免费试用WPMU CDN选项七天，然后再看改进情况做出决定。还有，别忘了 享受八折优惠 使用下面的链接查看任何WPMU产品或包装交易。 Gumlet另一个拥有200多种持久性PoPs的伟大的CDN选择。它提供图像优化，视频优化选项，使你的网站加载非常快。 除了付费计划，Gumletoffers还提供了一个完全免费的计划，你可以在一个网站上使用。你每月可获得1 GB带宽，每增加1gb得支付1美元。 Gumlet为你提供完整的分析和简单的仪表板来管理你的项目。 Cloudinary如果你正在管理一个图片量很大的网站，从你的服务器上卸载图片是一个很好的主意，因为这将为你节省大量的带宽，让你的网站变得更快。 Cloudinary是一项服务，它为你提供了在服务器上托管映像的选项。他们有一些计划，你可以托管10 GB的托管存储和20 GB的月带宽。 我已经讨论了大多数主要的竞争对手 免费CDN解决方案. 其中一些确实有付费计划，但他们的免费计划也是终身使用的。 接下来，我将了解一些提供有限试用的高级CDN服务。 你可以用这些来看看一个CDN服务能在你的网站上有多大的改进，如果利润超过成本，那么请随意订阅他们的一个计划。 试用版可以免费使用 KeyCDNKeyCDN提供250GB流量，有 30天试用期. 这包括该服务提供的每一项功能，包括HTTP/2支持、自定义和共享SSL，无需额外付费。该公司有25个数据中心，并免费提供5个区域。 关于KeyCDN最好的一点是，在试用期的注册过程中，不会要求你提供任何信用卡详细信息。 输出页面的加载时间对网站访问者的用户体验有着至关重要的作用。这可能是导致访问者放弃页面的主要因素之一。这就是为什么这么多人使用免费的CDN来增加页面加载时间。 根据一项调查，40%的用户会放弃加载时间超过3秒的页面。更糟糕的是，79%的网络购物者表示，如果他们发现网站的性能很差，他们就不会再返回网站。 毫无疑问，提高网站的速度对你的在线业务的成功至关重要。这就是WordPress的免费内容交付网络可以带来巨大变化的地方。 什么是CDN？内容传送网络，有时也称为内容分发网络，本质上是一个地理上分布的超级强大的代理服务器网络，设计用于托管静态内容，并根据用户的地理位置向他们传送静态文件的缓存副本。它们通常作为服务提供，可以添加到你的网站。 由全局CDN(而不是你的网络服务器)提供的静态资源包括图像、pdf、视频、静态库(如JavaScript和CSS文件)以及构成你网站的所有其他大量内容。 这个网络的主要目标是通过从一个比你的web服务器更近的位置(从地理位置和物理位置)以尽可能低的延迟将所有静态文件传递给用户，使你的站点负载超级快，这意味着传递这些内容所需的时间要短得多。 这些服务大多提供免费的CDN，或者作为服务的试用，或者作为吸引更多用户使用其服务的一种方式。 看看这段1分钟的视频，了解CDN在现实生活中是如何工作的: 为了更好地理解CDN(或者免费CDN)是如何工作的，你还可以查看GTmetrix提供的这张便捷的图片: 因此，本质上，内容分发网络是一个由分布在全球不同位置的多台服务器组成的网络。CDN缓存你站点的所有静态内容和文件，并根据用户的地理位置，通过离他们最近的服务器将其传递给访问者。 下图可以帮助你了解全局CDN是如何工作的，以及它如何提高你的域的页面加载时间。 这种服务的工作方式非常简单。 与托管提供商不同，托管提供商从一个位置(上图中的源服务器)为你的资源提供服务，该服务将你的WordPress站点的所有静态资源复制到其高速服务器网络中。从上图中可以看出，一个大型的全球CDN将有相当多的这些服务器分布在人口密集区域内或周围的多个数据中心。 但是作为一个经营几个网站的人，也许你经营一个经销商托管业务，你会知道你需要节约资源，一个免费的CDN肯定会有所帮助。 每当用户试图访问你的网站时，该服务会自动将请求从原始服务器重定向到离用户物理位置最近的服务器的缓存中，并向用户提供缓存的文件。 这一过程减少了网站数据的整体传播时间，最终导致更快的页面加载时间、更好的搜索引擎排名和更好的用户体验。 内容交付网络有三种主要类型: 内容服务协议: 这些是完全托管的网络，旨在为用户提供对网站文件的访问。我在这篇博文中讨论的CDN服务就属于这种类型。 对等cdn: 由于设置和运行成本非常小，点对点(P2P)设置在个人计算机之间工作，因此不适合托管你网站的文件。BitTorrent是对等网络的一个流行例子。 私有 CDNs: 或者，如果你对可用的服务不满意，你可以创建自己的私人服务。这意味着你必须创建和管理自己的全球服务器网络来为你的静态文件提供服务。 最重要的是，使用这样的CDN服务(或免费CDN)不仅可以提高你网站的速度，还可以节省托管提供商的带宽成本。此外，拥有一个更快的网站也可以提高你的搜索引擎排名，因为快速的网站加载速度是一个积极的排名因素。 现在，事情是这样的，很多这些服务的成本相当高，所以如果你能为WordPress找到一个便宜或免费的CDN，那当然就更好了，因为你可以提高你的网站速度，直到你能负担得起更好的内容分发WordPress服务。 根据你的预算、兴趣和要求，你可以选择以下任一选项。现在让我来看看这样一个CDN如何让你的WordPress受益。 想要一个真正快速的网站？集体一段时间以来，我一直看到流量激增。跟上需求并保持快速网站的唯一方法是实施周围最好的内容交付服务之一——stack path CDN——以前是MaxCDN。 我由StackPatch提供动力，因为我真正关心我的用户。与其去免费的CDN，我更愿意每月只支付20美元，让我的大脑完全休息。我有一个极快的网站，也有出色的支持，所以我对StackPath非常满意；-) 立即试用StackPath CDN(免费试用)https://www.stackpath.com/ 如果你运行此CDN的试用，发现你对服务不满意，你将获得30天的退款保证，因此完全没有风险。 Shift8 加拿大一家网页设计公司Shift8开发并发布了一项完全免费的CDN服务。 看到一家私人公司完全免费发布这样的服务，我非常惊讶，但似乎他们已经成功了。虽然我自己没有尝试过，但该服务在世界各地有很多端点，因此是一个不错的选择。 它是由一个WordPress插件驱动的，你只需要安装和激活它，你就可以开始了！免费计划在社区论坛的支持下有2个网址限制，而你可以选择付费计划，有更多的功能，如Brotli压缩、10个网址限制和更好的支持。 我很乐意从尝试这种方法的用户那里得到更多的反馈，所以如果你已经用过了，请在下面的评论中告诉我。据我所知，这家CDN提供商和下一家都无法提供DDoS保护。 Anyone CDN 这是另一个由个人运营的免费CDN服务——这一次是Ferdian Alfianto。据我所知，该服务仅依靠捐款运行，他们唯一可执行的限制是公平使用——即他们的免费CDN服务上没有一个网址可以使用超过20%的带宽。 功能上有一些限制，但是对于零的总价格，应该理解会有一些限制。你可以使用 CDN启用程序插件https://wordpress.org/plugins/cdn-enabler/ 让它在WordPress上工作，然后，在插件的CDN网址中添加通过任何人CDN网站创建的网址。 该服务仍然有一个BETA标签，因此如果你遇到一些问题，你希望与开发人员联系，以便他们能够改进服务。 该服务由后台的Cloudflare、StackPath和BunnyCDN提供支持。 试一试，让我知道你的想法。 面向网络开发者的免费CDN虽然以前有一些免费的CDN服务可以与WordPress一起使用，但我现在转向免费的CDN服务，这些服务主要用于托管将被大量用户使用的文件。 例如，如果你创建了一个将免费发布并可由其他开发人员使用的Javascript库，那么你可以使用jsDelivr提供的免费CDN来托管这个库，而不是自己承担成本。 1. 微软Ajax内容交付网络这是我的免费CDN服务列表中的第一个，主要供开发人员使用，由Azure提供支持。这个想法是托管流行的第三方Javascript库，如jQuery，使开发人员能够轻松地将它们添加到他们的网络应用程序中。 与其他此类提供商一样，通过利用这一点，有可能显著提高Ajax应用程序的性能，因为除了通过浏览器缓存实现相同文件的可重用性之外，此类文件的内容还缓存在世界各地的多个服务器上。 9付费WordPress CDN现在我已经看到了一些免费选项，我转向了我认为更好的选项，即付费的WordPress CDN服务。像往常一样，你得到了你付钱买的东西，我相信选择付费服务总是一个更好的主意。 价格从最低3.50美元/月开始，我认为选择这种服务是一个更好的主意。 Sucuri Sucuri最出名的是它的网络安全产品，基本上确保你的网站不会成为基于网络的攻击的受害者。 但是，考虑到该服务作为反向代理来保护你的网站免受攻击，它还通过其CDN提供网站性能包。Sucuri的性能CDN通过存在点(POPs)通过全球任播网络工作，在美国、欧洲和亚洲有10个超级节目，在澳大利亚和巴西有2个CDN POPs。 一旦你订阅了苏库里网络应用防火墙，你就可以通过域名系统的改变来激活。专业版(如果你的网站启用了HTTPS功能，这是必需的)的价格为299美元/年，但请记住，你可以获得CDN的所有功能以及网络应用防火墙的所有功能。 Sucurihttps://sucuri.net/ 云存储服务 使用免费云存储服务托管网站上的可下载文件是节省服务器带宽的最佳方法之一。你只需要将可下载的文件上传到你的云存储中，公开并在你的页面上分享下载链接。 以下是一些最受欢迎的云存储解决方案。 Dropbox- 最高2 GB的无成本。 Google Drive- 你不需要支付高达15 GB的任何费用。 Microsoft OneDrive- 免费高达7 GB。 谷歌云CDN (1年+300美元免费)谷歌有一项服务https://cloud.google.com/cdn/ 尽管它不能被严格归类为免费的CDN，但作为试用的一部分，它为你提供了300美元的积分，可在使用该服务的前12个月内使用。 这是一个云平台，类似于AWS的Cloudfront服务，可以访问谷歌云平台。 虽然这是一个你可以使用的选项，但它通常是推荐给那些有复杂的WordPress基础设施的人使用的，这些基础设施经常承受很大的负载，而不是推荐给你的普通用户。 MetaCDN MetaCDN提供7天免费试用。它的一些特点是: 详细分析: 与Internap类似，MetaCDN也提供详细的使用和性能报告。 MultiCDN: 当你的访问者试图访问你的网站时，会根据哪个服务器位置对他们来说最快来选择服务器位置。如果在一个地区有多个供应商，他们将从最快的供应商那里获得资源。 9. CDN77 CDN77.com是另一个优质的CDN服务，提供了一个安全，可靠和负担得起的解决方案。 CDN77支持最新启用的技术，例如HTTP/2、带有TLS 1.3的免费Instant SSL证书、Gzip和Brotli压缩、DDoS保护、Hotlink保护以及许多其他功能。 它有两个主要产品，一个用于静态文件，一个用于视频处理和传送。 CDN77.com支持4个WordPress插件(WP Fastest Cache、ZenCache、W3 Total Cache和WP Super Cache)，并拥有许多其他CMS集成(Joomla、Drupal、Magento、Prestashop等)，目前拥有超过35个存在点，数据中心分布在5大洲，网络容量为30 Tbps+以上。 CDN77.com既有没有承诺的月度计划和现收现付计划，也有企业的大批量计划。 免费CDN试用不需要信用卡。 主要优势虽然使用CDN的好处很多，但以下只是其中的几个: 速度: 网站性能的显著提高是人们选择使用这项服务的主要和最大原因之一。CDN缩短了用户和服务器之间的物理距离，大大降低了网络延迟，使你的站点以光速加载。 高全局可用性和可扩展性: 如果你的主服务器因流量突然激增而停机或崩溃，该怎么办？启用后，你的网站将始终保持运行，因为有多个服务器处理流量。看看CloudFlare的“永远在线”技术，它让网站永远保持活力。CDN将有助于减轻你的网络服务器的负载。 安全: 利用WAF(网络应用防火墙)和Origin Shield等尖端技术，许多提供商提供了额外的安全层，以保持数据安全，处理客户交易，并提供DDoS保护、DNS放大和第7层攻击。只有这样一个服务器协同工作的全球网络才能很好地处理DDoS保护，以抑制攻击。 搜索引擎优化优势: 每个人都喜欢极快的体验，尤其是谷歌，早在2010年，它就将速度作为一个重要的排名因素。除了帮助你在搜索引擎结果中排名更高之外，这些服务还提高了你在谷歌图像搜索中的图像抓取率，并提高了你网站的整体抓取率，确保你的网站排名更好。 降低带宽成本: 从你的原始托管服务器上卸载CPU、流量和其他资源，CDN或免费CDN可以将带宽请求最多减少70%。带宽请求越低，你通过网络主机节省的带宽成本就越多。如果你的网站托管提供严格的带宽计量，这一点尤其重要。 为什么需要速度？作为网站所有者，我经常检查我网站的加载速度，因为我经常访问并对照已知的性能测试工具进行检查。 即使你觉得你的网站加载速度很快，也有很大一部分网站访问者的加载时间比你看到的要慢得多，尤其是那些在不同国家或地理位置的访问者。 但是为什么会这样呢？ WordPress网站的速度不仅取决于质量，还取决于你的网络主机的实际位置 。这意味着，除非你的网络服务器有全球分布的位置，否则它永远不会对世界各地的所有用户都很快。 虽然WordPress允许几种简单且经济的方法(如优化图像、缩小CSS和JavaScript、设置缓存插件以更快地生成页面并利用WordPress的浏览器缓存)来提高网站速度，但这些优化都不如实现CDN强大且高效。 顺便说一句，如果你想让你的网站加载得更快，有几个插件，比如WP Rocket，可以在几分钟内(几乎不费吹灰之力)带来真正的性能提升。 现在还没准备好使用插件？继续读… 如果我获得了CDN，我还需要托管吗？是的，如果你有CDN，你仍然需要托管。你的网络主机仍然是你网站的基础，你可以在其中保存所有非静态文件。免费的CDN或CDN是一个额外的层，它接收所有庞大的静态文件，并通过其强大的全球服务器网络复制它们。 这是用户在他们的网站上实施CDN时最常问的问题之一。 把你的网络主机想象成一种虚拟空间，你花钱租你的在线业务，也就是你的WordPress。这是你上传和存储页面、图像、视频、PHP文件、数据库和其他你需要完美运行你的域的所有东西的地方。 相反，CDN是你在你的网络托管账户上使用的东西，它只是加快了速度。 CDN永远无法取代你的网络托管账户。你仍然需要一个WordPress托管服务器来存储你的所有文件以及WordPress安装本身。 最近，许多优质或托管托管网站正在提供免费的CDN，作为网站托管计划的一部分。 如何设置CDN？对于大多数网站来说，它非常容易实现。通常有两种方法可以做到这一点。 CDN 插件 - 安装一个插件，将静态文件的URL更改为CDN服务的地址(例如，KeyCDN使用这种方法) 使用域名系统的反向代理 - 更改你的域的域名系统条目，以指向CDN服务的地址。这被称为反向代理服务(例如，Cloudflare提供了这种方法) 对于第一种方法，插件正在指示网络服务器将图像的网址更改为免费的CDN服务的网址。通过这种方式，访问你网站的浏览器可以向内容交付网络(CDN)服务发送下载静态文件的请求。你可能还需要修改域名系统记录，以将它们指向cdn.yourdomain.com之类的地方。 查看下面的图片，显示了指向我的CDN的静态文件的网址: 在第二种方法中，你网站的名称服务器被更改为CDN服务的名称服务器，而不是托管服务器的名称服务器。这意味着CDN处理发送到你网站的所有流量。它提供所有静态内容，然后向你的web服务器发送动态内容请求，动态内容也提供给浏览器。 现在让我看看你可以选择的各种免费的WordPress内容交付网络服务，这些服务完全不需要任何费用。如果你超出了免费CDN计划的范围，这些服务提供商大多允许你升级到付费服务。这很棒，因为它允许你在建立流量的同时慢慢开始。 说到设置这项服务，有很多选择，既有免费的，也有收费的。 然而，最好的办法是选择一家提供捆绑免费CDN服务集成的网络托管服务提供商，比如Kinsta和WPEngine。如果你已经投资了一个网络托管包，下面是一些知名的第三方提供商，你应该去看看: 必须使用CDN的WordPress网站类型既然你已经理解了拥有免费CDN的逻辑，你需要问自己的问题是:你如何确定你的网站是否需要CDN的帮助？ 嗯，免费的CDN服务对任何网站来说几乎在每一个方面和每一个场景中都是有益的。 然而，在某些情况下，使用一个对网站来说变得至关重要。如果出现以下情况，你必须利用免费CDN或CDN的力量: 你的流量正在快速增长 你的网站正在接收来自全球不同国家的大量全球流量 你有一个包含大量图像、视频或音频的复杂的、媒体密集型的领域 你的网站很容易突然出现流量高峰，例如，你有一个以woodeconomy为动力的在线商店，经常在网络服务器上承受沉重的负载，尤其是在节假日和特价销售期间 如果你有一个网站，利用来自第三方网站、软件或服务的资源，如视频、广告、表格和聊天服务。 如果你有一个在线社区网站，倾向于在特定的时间(流量高峰)聚集一群人 你的预算允许为你的WordPress站点选择一个CDN。 如果你的WordPress网站有上述任何一点，你应该尽快开始使用CDN。 仅适用于非常特定的地点，并且其主机已经设置在靠近其目标人群的地点的网站(例如，你的客户在美国的西侧，而你的主机已经托管在西侧的数据中心)。在这种情况下，你应该加快设置其他速度优化技术的速度，如图像优化、CSS缩小和设置一个好的缓存插件。 选择CDN时的关键因素不管你是选择免费的CDN还是付费服务，在为你的WordPress网站选择合适的CDN时，你都应该考虑几个关键因素。以下是需要考虑的几个主要因素: 带有分析报告的用户友好仪表板 通过插件或流行的缓存工具，与WordPress轻松集成 在网站流量大的地区，服务器(POPs)的可用性 实时内容清除 HTTP/2支持 免费SSL集成 良好的客户支持 合理的定价——它应该很容易放在你的口袋里。 WordPress需要知道哪个内容交付网络将托管你的内容。你可以使用WordPress缓存插件来实现这一点，例如W3 Total Cache、WP Super Cache或WP Rocket。通过使用这些插件，你可以定义希望WordPress卸载到你的内容交付网络的内容。例如，你可以选择存储图像、CSS、Javascript等。你也可以通过你的CDN声明你想要(和不想要)哪些文件夹。内容交付网络将为你提供网址和其他重要的连接信息，你需要在你的WordPress CDN插件中输入这些信息。 UploadcareUploadcarehttps://uploadcare.com/cdn/ 拥有一个完整的文件处理平台，该平台还包括一个非常强大的CDN。说到WordPress CMS，Uploadcare打破了许多WP Media库的限制，并通过一些很棒的功能(如自适应交付或媒体代理)帮助提高网站性能。 Uploadcare CDN在全球拥有超过235，000个数据中心，更重要的是，每月使用高达30 GB的流量是安全和免费的。在其CDN上托管的所有文件都可以利用智能图像压缩和设备感知交付功能–它可以针对任何设备自动调整最大可能的压缩和格式，最大限度地保持视觉质量。 在这篇文章中，我将帮助你为WordPress找到最好的免费CDN，这样你就可以从世界各地的服务器网络中提供你的图像和其他静态文件。 Optimole Optimole是一个多合一的解决方案，用于优化你的WordPress网站的图像，然后通过全球亚马逊云前端CDN快速提供这些图像……免费！ 让我从CDN部分开始，因为这是一篇关于WordPress免费CDN服务的帖子。 即使在免费层，Optimole也会通过亚马逊网络服务(AWS)的CDN服务亚马逊云前端(Amazon CloudFront)自动提供你的WordPress网站的所有图像、CSS和JS。 然而，Optimole不仅仅是一个CDN。它还可以自动帮助你… 调整图像大小，包括自适应图像功能，可根据每个访问者的设备大小提供最佳的图像分辨率。 使用有损或无损压缩来压缩图像。 为图像添加水印以防止图像被盗。 将你的图像转换为WebP格式。 懒加载你的图片。 唯一需要记住的是，为了使用它来服务JS/CSS，你需要从插件设置中手动激活它。 速度是网络用户体验的主要方面之一。你的网站需要超级快，以保持用户对你网站上提供的内容感兴趣。如果你的网站建立在WordPress上，你可以尝试几种策略来优化网站的速度和性能。使用内容传递网络是提高页面加载速度的常用策略之一。在本文中，我将讨论一些你可以用来提高网站性能的顶级免费CDN服务。 好处:云提供商提供慷慨的免费CDN使用最后，值得一提的是，许多云服务提供商提供慷慨的免费试用/积分来试用他们的服务，包括他们的cdn。 这里有两个流行的选项: – 亚马逊CloudFront CDN可以获得12个月/50 GB的免费使用。这与上面的Optimole插件使用的CDN相同。 Google Cloud Platform – 在最初的12个月里，你可以获得300美元的积分来购买产品。你可以在谷歌的云CDN上使用这个信用。如果你的网站不是超高流量，你可以在整个12个月的时间里保持这个信用额度。 不过，这些服务更具技术性，所以它们确实只对开发人员或其他技术用户来说是一个不错的选择。 WordPress用户最好的免费CDN是什么？对于WordPress用户来说，最好的免费CDN取决于你想通过你的CDN提供什么。 如果你有一个图片量很大的网站，并且主要是想通过你的CDN提供图片文件，你会想去看看 Optimolehttps://wordpress.org/plugins/optimole-wp/ 除了从亚马逊CloudFront免费提供强大(和优质)的CDN，Optimole还可以通过压缩和自适应图像大小等多种方式优化你的图像。 另一方面，如果你正在寻找一个免费的CDN服务来处理你所有的静态文件，包括CSS和JavaScript文件，那么 Cloudflarehttps://www.cloudflare.com/ 是你最好的选择。它不仅拥有庞大的全球网络，而且还集成了大量其他方便的性能和增强安全性的功能。 如果你发现将名称服务器更改为指向Cloudflare太复杂， Jetpackhttps://wordpress.org/plugins/jetpack/ 提供了一种更简单的方法来开始使用全面的CDN。但是我认为花时间设置Cloudflare仍然是你的最佳路线，因为Cloudflare拥有更大的全球网络，并且更加灵活。 免费 CDN 服务如果你担心维护你的WordPress站点的任何额外费用，你可以使用几种免费的CDN服务。 BootstrapCDNBootstrapCDN是StackPath提供的免费服务。你可以将它用于Bootstrap的CSS和JS。这是一个可靠和安全的服务，你可以利用它来优化CSS和JS文件的传递。 这是一个安全可靠的免费的CSS和JS文件的CDN。 cdnjscdnjs是免费CDN服务最受欢迎的选项之一，被很多网站使用。根据统计数据，超过9%的网站使用这项服务。它由Cloudflare、数字海洋和Algolia赞助。 全世界超过9%的网站使用cdnjs服务。 通过免费的CDN服务确保更好的站点性能如果你拥有一个网站，重要的是要确保它能在短时间内向用户加载内容。在流量激增的情况下，你可以通过使用内容交付网络来减少托管服务器的负载。希望这篇文章为你提供了一些免费CDN服务的好选择。如果你有疑问，请给我留言。","categories":[],"tags":[]},{"title":"BT tracker 下载服务器列表","slug":"TrackersListCollection","date":"2022-01-21T08:57:58.576Z","updated":"2022-01-22T02:31:08.506Z","comments":true,"path":"2022/01/21/TrackersListCollection/","link":"","permalink":"https://blog.furrysp.top/2022/01/21/TrackersListCollection/","excerpt":"","text":"Torrent跟踪器 用于帮助找到对等体，并相互建立直接连接，以便进行对等种子传送。 Torrent追踪器列表 在这种情况下很有用，因为你可以给torrent客户端软件一个列表，提高uTorrent的下载速度，因为追踪器越多，连接越直接，速度也就越高。如果你想要种子追踪器的工作列表，那么继续前进，并遵循我的种子追踪器指南。正如你已经知道的，域外最近被关闭，所以你可能需要域外替代网站，这里有一些更多的公共和私人追踪器网站。 什么是Torrent Tracker种子追踪器是一个跟踪种子用户的服务器，保存种子和用户的数量、种子文件大小和下载数量等信息。Torrent是一个点对点的过程。没有种子的中央服务器。那么用户如何找到对方呢？ 使用 追踪器, 很简单。Torrent的工作原理是创建一小块文件，并在 “swarm “ 之间共享和分发该文件。 当你把一个 .torrent 文件放到你的torrent客户端上，比如uTorrent、Vuze、Bittorrent、qTorrent等。它只是使用这些洪流追踪器来寻找同伴。假设有900个播种者在播种一个种子，800个用户在下载种子。 现在 追踪器的工作 是找到对下载特定种子文件感兴趣的人，当任何用户想要下载种子文件时， 种子客户端会将此 请求 并要求 追踪器 注册 该用户的IP和端口。 然后，追踪器接受请求，并试图通过 播种种子 或当前 下载种子来找到其他也表现出兴趣的用户。 当torrent客户端从torrent跟踪器中找到所有这些信息时，所有对等体之间就会 建立直接连接 。 如你所见，种子追踪器知道你的IP地址和端口。 现在，关于追踪器有一些争议。好莱坞电影公司雇佣了一支由专业人士组成的特殊洪流搜索团队，他们通常可以运行一个应用程序，在它与其他同行建立联系后，它可以很容易地记下IP地址。请注意，大多数公共追踪器都可以像这样用来追踪种子下载器或上传器。一些版权保护机构甚至运行honeypot tracker，以便跟踪种子下载者。所以我敦促所有的种子用户使用一个虚拟专用网络进行种子。当你连接到一个虚拟专用网时，你的真实IP地址被屏蔽，你的在线活动对所有的互联网服务提供商、版权巨魔、政府都是隐藏的。机构。为了保护你的隐私和避免侵犯版权，请注意你必须打开Torrent VPN。在我广泛的种子下载测试中，我发现私人互联网接入提供了惊人的下载速度，因为他们所有的服务器都是专门为种子和P2P下载而优化的。 Torrent tracker的类型有两种类型的种子追踪器，例如 公共 和 私有 . 公共追踪器或开放追踪器意味着任何用户都可以通过简单地打开他们的bitTorrent客户端并添加追踪器地址来使用追踪器。公共追踪器不需要注册或邀请。另一方面，私人追踪器只对注册用户开放，他们根据上传或下载比例限制使用。你可以从我的公共与私人追踪器列表中了解更多信息。 Torrent tracker 做不到的事？它不是同行之间的代理人或中间人。 它不能在对等体之间共享数据。 它不存储 .torrent文件元数据。 它不知道你下载的是种子文件的哪个部分。 我使用追踪器只是为了提高种子下载速度，它是有效的。 当你发现一个种子较少的种子文件时，你可以借助这些追踪器服务器，这样你就可以找到当前列表没有追踪到的种子。 工作种子追踪器列表的下载链接下载种子跟踪器列表 2022年更新的种子追踪器列表如果你经常下载种子，我建议你使用种子虚拟专用网对你的互联网服务提供商和政府隐藏你的身份。为了更安全的做种。这是我推荐的托雷林最佳虚拟专用网列表。 udp://opentracker.i2p.rocks:6969/announce http://opentracker.i2p.rocks:6969/announce udp://tracker.opentrackr.org:1337/announce http://tracker.opentrackr.org:1337/announce udp://tracker.internetwarriors.net:1337/announce http://tracker.internetwarriors.net:1337/announce udp://exodus.desync.com:6969/announce udp://tracker.cyberia.is:6969/announce udp://3rt.tace.ru:60889/announce http://5rt.tace.ru:60889/announce udp://explodie.org:6969/announce http://explodie.org:6969/announce udp://47.ip-51-68-199.eu:6969/announce udp://tracker.tiny-vps.com:6969/announce udp://tracker.ds.is:6969/announce udp://retracker.lanta-net.ru:2710/announce http://open.acgnxtracker.com:80/announce udp://www.torrent.eu.org:451/announce udp://tracker.torrent.eu.org:451/announce udp://open.stealth.si:80/announce udp://tracker.moeking.me:6969/announce udp://ipv4.tracker.harry.lu:80/announce http://tracker.dler.org:6969/announce http://rt.tace.ru:80/announce udp://valakas.rollo.dnsabr.com:2710/announce udp://opentor.org:2710/announce udp://cdn-2.gamecoast.org:6969/announce udp://cdn-1.gamecoast.org:6969/announce https://trakx.herokuapp.com:443/announce http://h4.trakx.nibba.trade:80/announceudp://t3.leech.ie:1337/announce udp://t2.leech.ie:1337/announce udp://t1.leech.ie:1337/announce udp://vibe.community:6969/announce udp://tracker0.ufibox.com:6969/announce udp://tracker.zerobytes.xyz:1337/announce udp://tracker.v6speed.org:6969/announce udp://tracker.uw0.xyz:6969/announce udp://tracker.shkinev.me:6969/announce udp://tracker.army:6969/announce udp://storage.groupees.com:6969/announce udp://nagios.tks.sumy.ua:80/announce udp://mts.tvbit.co:6969/announce udp://movies.zsw.ca:6969/announce udp://mail.realliferpg.de:6969/announce udp://ln.mtahost.co:6969/announce udp://line-net.ru:6969/announce udp://fe.dealclub.de:6969/announce udp://engplus.ru:6969/announce udp://edu.uifr.ru:6969/announce udp://discord.heihachi.pw:6969/announce udp://daveking.com:6969/announce udp://cutiegirl.ru:6969/announce udp://code2chicken.nl:6969/announce udp://bubu.mapfactor.com:6969/announce udp://bt2.archive.org:6969/announce udp://bt1.archive.org:6969/announce udp://blokas.io:6969/announce udp://aruacfilmes.com.br:6969/announce http://vps02.net.orel.ru:80/announce http://tracker.zerobytes.xyz:1337/announce http://t.overflow.biz:6969/announce udp://us-tracker.publictracker.xyz:6969/announce udp://u.wwwww.wtf:1/announce udp://tracker4.itzmx.com:2710/announce udp://tracker2.dler.org:80/announce udp://tracker1.bt.moack.co.kr:80/announce udp://tracker.lelux.fi:6969/announce udp://tracker.fortu.io:6969/announce udp://tracker.altrosky.nl:6969/announce udp://tracker.0x.tf:6969/announce udp://torrentclub.online:54123/announce udp://inferno.demonoid.is:3391/announce udp://bt2.3kb.xyz:6969/announce udp://bt.okmp3.ru:2710/announce http://tracker1.bt.moack.co.kr:80/announce http://tracker.gbitt.info:80/announce http://tracker-cdn.moeking.me:2095/announce http://torrentclub.online:54123/announce http://bt.okmp3.ru:2710/announce udp://zephir.monocul.us:6969/announce udp://www.loushao.net:8080/announce udp://udp-tracker.shittyurl.org:6969/announce udp://tracker.zemoj.com:6969/announce udp://tracker.skyts.net:6969/announce udp://tracker.sigterm.xyz:6969/announce udp://tracker.loadbt.com:6969/announce udp://tr2.ysagin.top:2710/announce udp://tr.cili001.com:8070/announce udp://retracker.sevstar.net:2710/announce udp://retracker.netbynet.ru:2710/announce udp://public-tracker.zooki.xyz:6969/announce udp://johnrosen1.com:6969/announce udp://free-tracker.zooki.xyz:6969/announce udp://drumkitx.com:6969/announce udp://camera.lei001.com:6969/announce udp://bioquantum.co.za:6969/announce udp://admin.videoenpoche.info:6969/announce udp://6ahddutb1ucc3cp.ru:6969/announce https://w.wwwww.wtf:443/announce https://tracker.tamersunion.org:443/announce https://tracker.sloppyta.co:443/announce https://tracker.renfei.net:443/announce http://tracker.vraphim.com:6969/announce http://tracker.sloppyta.co:80/announce http://tracker.skyts.net:6969/announce http://tracker.noobsubs.net:80/announce http://tracker.loadbt.com:6969/announce https://tracker.nitrix.me:443/announce https://tracker.nanoha.org:443/announce https://tracker.lelux.fi:443/announce https://tracker.imgoingto.icu:443/announce https://tracker.hama3.net:443/announce https://tracker.foreverpirates.co:443/announce https://tracker.coalition.space:443/announce https://1337.abcvg.info:443/announce http://www.loushao.net:8080/announce http://vpn.flying-datacenter.de:6969/announce http://tracker2.dler.org:80/announce http://tracker.lelux.fi:80/announce http://torrenttracker.nwc.acsalaska.net:6969/announce http://t.nyaatracker.com:80/announce http://t.acg.rip:6699/announce http://retracker.sevstar.net:2710/announce http://pow7.com:80/announce http://open.acgtracker.com:1096/announce http://ns3107607.ip-54-36-126.eu:6969/announce http://mail2.zelenaya.net:80/announce http://bt.100.pet:2710/announce http://bobbialbano.com:6969/announce udp://tsundere.pw:6969/announce udp://tracker.kali.org:6969/announce udp://tracker.dler.org:6969/announce udp://tracker-udp.gbitt.info:80/announce udp://tr.bangumi.moe:6969/announce udp://public.publictracker.xyz:6969/announce udp://open.lolicon.eu:7777/announce udp://ns389251.ovh.net:6969/announce udp://ns-1.x-fins.com:6969/announce udp://concen.org:6969/announce udp://bt2.54new.com:8080/announce udp://bt.firebit.org:2710/announce udp://anidex.moe:6969/announce https://tr.ready4.icu:443/announce http://tracker4.itzmx.com:2710/announce http://tracker.bt4g.com:2095/announce 请注意，在每个跟踪器后，我都放了一个空行，这是分隔层所必需的。只需复制上述所有追踪器，并将其粘贴到你的种子客户端，如uTorrent。 如何给utorrent添加新的追踪器？要添加列表，只需复制并打开你的应用程序。右键单击 列表中的种子文件，然后从底部选择 Properties(属性) 。将出现一个新窗口，你可以在其中粘贴跟踪器。 如果你发现更多的种子追踪者网站没有在这里列出，请在评论中留下，这样我就可以用新的更新帖子。","categories":[],"tags":[]},{"title":"如何安装Windows系统（上）","slug":"install-windows","date":"2021-12-18T13:55:10.509Z","updated":"2021-12-18T14:17:46.431Z","comments":true,"path":"2021/12/18/install-windows/","link":"","permalink":"https://blog.furrysp.top/2021/12/18/install-windows/","excerpt":"","text":"🧈 缘由note warning 懒人请回避 最近我的同学老是问我如何重装电脑，用老毛桃，大白菜制作U盘启动安不安全，装完系统后会不会自动装上垃圾全家桶，那么我在这里就把目前我已知的最纯净的装系统的方法写出来 〽️ 开始首先一谈到装机，那网上一大堆 都是烂大街的软件，甚至还有花钱装系统的，现在花钱的门槛都那么低了吗，装个系统都可以赚钱，但是装出来的系统是不是纯净的就不得而知了就连去电脑店装的系统都有一些潜在的垃圾软件或病毒 因为那些像老毛桃和大白菜的装机软件都是一条龙式的服务，下载，备份以及安装都用他自带的服务，丝毫不能判断给你装过的系统是否纯净，这样的话会在后续使用中出现一些意料之外的问题。 我们自己刷系统的话得需要一定的时间，但同时能极大降低危害，以下有三个个步骤 找系统镜像 找PE 安装 系统镜像有很多种，包括第三方制作的系统，在这里我只列出Windows 首先打开MSDN MSDNhttps://next.itellyou.cn/ 新网站是要登录的，登录之后便可找到你想要刷入的系统 随后我们百度一下微PE 你需要一个4个G以上的U盘来制作PE启动盘 这里弹出来要捐赠，点击跳过就彳亍了，下载完后选择制作启动U盘，选择默认设置直接点下一步，静待几分钟启动U盘就做好了","categories":[],"tags":[]},{"title":"WP | 将评论用户的头像换成QQ镜像源","slug":"Change-the-comment-user-avatar-to-QQ-mirror-source","date":"2021-12-18T10:36:48.063Z","updated":"2021-12-18T14:15:24.316Z","comments":true,"path":"2021/12/18/Change-the-comment-user-avatar-to-QQ-mirror-source/","link":"","permalink":"https://blog.furrysp.top/2021/12/18/Change-the-comment-user-avatar-to-QQ-mirror-source/","excerpt":"","text":"Avart不好用吗？考虑到大多数人设置avart头像需要科学上网，故自研将评论头像源更换的方法。该方法只修改了“文章评论”以及“最近评论”组件模块的评论用户头像。个人认为最佳解决方案为更换wp原生“get_avart()”函数内部方法（因为懒所以没研究(;^_^A）。 修改的模板位置因主题而异可以自行研究～ 源码与原理文章评论模块在“外观” → “主题编辑器” 中找到模板：“theme-article.php (inc/theme-article.php)”将get_avatar($comment, 50);函数注释掉添加以下php方法： 最近评论组件模块在“外观” → “主题编辑器” 中找到模板：“theme-widgets.php (inc/theme-widgets.php)”将get_avatar();函数注释掉添加以下php变量声明： $arr = explode(“@”,$comment-&gt;comment_author_email);$header_img = “http://q1.qlogo.cn/g?b=qq&amp;nk=&quot; . $arr[0] . “&amp;s=640”;在目标get_avart()函数位置替换为以下php变量： $header_img至此完成QQ头像镜像源的更替，类似的直接变更wp的原生get_avart函数方法是最佳的解决方案！","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2021-12-18T08:59:41.748Z","updated":"2021-12-18T08:59:41.748Z","comments":true,"path":"2021/12/18/hello-world/","link":"","permalink":"https://blog.furrysp.top/2021/12/18/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}